import React from 'react'

const Header = () => {
    return (
        <header className='flex items-center justify-between px-[35px]'>
            <img src={process.env.PUBLIC_URL + '/logo.svg'} alt="" />

            <div className="search flex items-center">
                <input className='input-search' type="text" placeholder='Введите запрос'/>
                <button className='btn-search felx items-center px-3.5'>
                <svg width="17" height="17" viewBox="0 0 17 17" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M12.476 10.9904C13.3162 9.84651 13.8125 8.43433 13.8125 6.90625C13.8125 3.09203 10.7205 0 6.90625 0C3.09203 0 0 3.09203 0 6.90625C0 10.7205 3.09203 13.8125 6.90625 13.8125C8.43474 13.8125 9.84726 13.316 10.9913 12.4754L10.9904 12.476C11.0217 12.5185 11.0566 12.5592 11.0951 12.5977L15.1862 16.6888C15.6011 17.1037 16.2739 17.1037 16.6888 16.6888C17.1037 16.2739 17.1037 15.6011 16.6888 15.1862L12.5977 11.0951C12.5592 11.0566 12.5185 11.0217 12.476 10.9904ZM12.476 6.90625C12.476 10.1337 10.1337 12.4754 6.90625 12.4754C3.67884 12.4754 1.5 10.1337 1.5 6.90625C1.5 3.67884 3.67884 1.5 6.90625 1.5C10.1337 1.5 12.476 3.67884 12.476 6.90625Z" fill="white"/>
                </svg>
                </button>
            </div>

            <div className="profilBlock flex items-center justify-between">
                <svg width="31" height="33" viewBox="0 0 31 33" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path fillRule="evenodd" clipRule="evenodd" d="M0 10.3125C0 8.03433 1.7349 6.1875 3.875 6.1875H18.4062C20.3744 6.1875 21.9999 7.74948 22.2483 9.77247L28.2756 7.49762C29.5568 6.89144 31 7.8898 31 9.38235L31 19.8359C31 21.3284 29.5568 22.3268 28.2756 21.7206L22.2812 19.8359L22.2483 23.2275C21.9999 25.2505 20.3744 26.8125 18.4062 26.8125H3.875C1.7349 26.8125 0 24.9657 0 22.6875V10.3125ZM22.2812 18.1345L29.0625 19.8359V9.38235L22.2812 12.0139L22.2812 18.1345ZM3.875 8.25C2.80495 8.25 1.9375 9.17341 1.9375 10.3125V22.6875C1.9375 23.8266 2.80495 24.75 3.875 24.75H18.4062C19.4763 24.75 20.3438 23.8266 20.3438 22.6875V10.3125C20.3438 9.17341 19.4763 8.25 18.4062 8.25H3.875Z" fill="#F0EEE7"/>
                    <rect x="9.6875" y="11.647" width="1.9375" height="9.70588" fill="#F0EEE7"/>
                    <rect x="15.5" y="15.5294" width="1.94118" height="9.6875" transform="rotate(90 15.5 15.5294)" fill="#F0EEE7"/>
                </svg>  
            </div>
        </header>
    )
}

export default Header